History

2009 -> Wes Mckinney -> MIT -> finance "C"
Minimal code
any data type
TABULAR DATA -> ROWS AND COLUMNS(SERIES)
ORDERED AND UNORDERED SERIES
Multi- dimension

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv(
    "F:/data_science_trainning/Module_4/Pandas/bank_client_information.csv"
)

In [5]:
df.head(10)

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

### Components

pandas / core : basic data structure -> Series and Dataframes

- munipulate
- pandas /src : algorithatic basic funcationality
- pandas/io : handling input output
- pandas/tools : merge, join, concat
- pandas/ sparse : missing value
- pandas / stats :statistical function
- pandas / util : debugging
- pandas / rpy : connection with R

#Use cases

- Recommendation system
- Advertising
- stock analysis
- Neuro science
- NLP

Pandas -> Series , Data Farme

In [6]:
ser1 = pd.Series([10, 20, 30, 40])
print(ser1)

0    10
1    20
2    30
3    40
dtype: int64

In [11]:
ser2 = pd.Series(
    [[10, 20], [30, 40, "series"], [50, 55], {"Name": "Tees", "Org": "Yasham"}]
)
print(type(ser2))

<class 'pandas.core.series.Series'>

DataFrame Object

In [12]:
# DataFrame object
df = pd.DataFrame([30, 50, 20])
print(df)

    0
0  30
1  50
2  20

In [16]:
df1 = pd.read_csv(
    "F:/data_science_trainning/Module_4/Pandas/bank_client_information.csv"
)

In [17]:
df1.shape  # rows columns

(3, 5)

In [19]:
df1.columns

Index(['First Name', 'Last Name', 'Email', 'Postal Code', 'Net Worth'], dtype='object')

In [34]:
df1.head())

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [36]:
df1.tail()

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First Name   3 non-null      object
 1   Last Name    3 non-null      object
 2   Email        3 non-null      object
 3   Postal Code  3 non-null      object
 4   Net Worth    3 non-null      object
dtypes: object(5)
memory usage: 248.0+ bytes

In [39]:
df1.describe()

       First Name Last Name           Email Postal Code   Net Worth
count           3         3               3           3           3
unique          3         3               3           3           3
top        Joseph    Patton  daafeja@boh.jm     M6U 5U7  $2,629.13
freq            1         1               1           1           1

In [40]:
pcdf = df1["Postal Code"]
pcdf

0    M6U 5U7
1    K2D 4M9
2    S1T 4E6
Name: Postal Code, dtype: object

In [43]:
# multiple columns
pcdf = df1[["Last Name", "Net Worth"]]
pcdf

  Last Name   Net Worth
0    Patton  $2,629.13
1     Moran  $8,626.96
2    Keller  $9,072.02

In [20]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [22]:
# renaming the columns
df.columns = ["V1"]
df

   V1
0  30
1  50
2  20

In [25]:
# renaming the indices
df.index = ["R1", "R2", "R3"]
print(df)
df1

    V1
R1  30
R2  50
R3  20

  First Name Last Name              Email Postal Code   Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [30]:
# Creting Data Frames with multiple Columns
df2 = pd.DataFrame([[10, 15, 20, 56], [100, 200, 300], [400, 500, 700, 800]])
df2
df2.shape

(3, 4)

In [32]:
df2 = pd.DataFrame(
    [[10, 15, 20], [100, 200, 300]], columns=["V1", "V2", "V3"], index=["R1", "R2"]
)
df2

     V1   V2   V3
R1   10   15   20
R2  100  200  300

In [ ]:
# Data Transformation